## Exercise:

The average activity for a particular event_type is the average occurences across all companies that have this event.

An active business is a business that has more than one event_type such that their occurences is strictly greater than the average activity for that event.

Write pandas code to find all active businesses.

Return the result table in any order.

The query result format is in the following example.

In [1]:
import pandas as pd

# Create the Events DataFrame
data_events = {
    'business_id': [1, 3, 1, 2, 3, 1, 2],
    'event_type': ['reviews', 'reviews', 'ads', 'ads', 'ads', 'page views', 'page views'],
    'occurences': [7, 3, 11, 7, 6, 3, 12]
}

events_df = pd.DataFrame(data_events)
events_df

   business_id  event_type  occurences
0            1     reviews           7
1            3     reviews           3
2            1         ads          11
3            2         ads           7
4            3         ads           6
5            1  page views           3
6            2  page views          12

In [2]:
events_df.describe()

       business_id  occurences
count     7.000000    7.000000
mean      1.857143    7.000000
std       0.899735    3.511885
min       1.000000    3.000000
25%       1.000000    4.500000
50%       2.000000    7.000000
75%       2.500000    9.000000
max       3.000000   12.000000

In [3]:
events_df.dtypes

business_id     int64
event_type     object
occurences      int64
dtype: object

In [13]:
events_df.columns

Index(['business_id', 'event_type', 'occurences'], dtype='object')

In [21]:
grouped_events = events_df.groupby(['event_type']).agg(avg_event=('occurences', 'mean')).reset_index()
grouped_events

   event_type  avg_event
0         ads        8.0
1  page views        7.5
2     reviews        5.0

In [23]:
merged_df = events_df.merge(grouped_events, on='event_type')
merged_df

   business_id  event_type  occurences  avg_event
0            1     reviews           7        5.0
1            3     reviews           3        5.0
2            1         ads          11        8.0
3            2         ads           7        8.0
4            3         ads           6        8.0
5            1  page views           3        7.5
6            2  page views          12        7.5

In [29]:
counted_businesses = merged_df[merged_df['occurences']>merged_df['avg_event']].groupby(['business_id'])['occurences'].count().reset_index()
counted_businesses

   business_id  occurences
0            1           2
1            2           1

In [30]:
counted_businesses[counted_businesses['occurences']>1]

   business_id  occurences
0            1           2